---
kind: method
id: M:Autodesk.Revit.DB.TriangulatedSolidOrShell.Dispose
source: html/1bef933b-028a-b49c-f621-573b3db66b4c.htm
---
# Autodesk.Revit.DB.TriangulatedSolidOrShell.Dispose Method

Releases all resources used by the TriangulatedSolidOrShell

## Syntax (C#)
```csharp
public void Dispose()
```